# 35. Напишите программу на Python для поиска пересечения двух заданных массивов с помощью Lambda.

[1, 2, 3, 5, 7, 8, 9, 10]
[1, 2, 4, 8, 9]

lst_1 = [1, 2, 3, 5, 7, 8, 9, 10]
lst_2 = [1, 2, 4, 8, 9]

a = list(filter(lambda x: x in lst_1, lst_2))
print(a)
