# -*- coding: utf-8 -*-
"""Task_jupyter_function.ipynb

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/1BZjR5PxcBC9y5KVyclV3jSJQ5aCRvACS
"""

# f(x) = -12x^4 - 18x^3+5x^2 + 10x - 30
# 1. Определить корни
# 2. Найти интервалы, на которых функция возрастает
# 3. Найти интервалы, на которых функция убывает
# 4. Построить график
# 5. Вычислить вершину
# 6. Определить промежутки, на котором f > 0
# 7. Определить промежутки, на котором f < 0
from sympy import *
from sympy.plotting import plot

x = symbols('x')
fx = -12*x**4 - 18*x**3 + 5*x**2 + 10*x - 30
fx

# 1. Определить корни
roots = solve(fx)
for i, root in enumerate(roots):
  print(f'x{i+1} = {root}')

# 2. Найти интервалы, на которых функция возрастает
# 3. Найти интервалы, на которых функция убывает
fd = diff(fx)
print('Интервалы возрастания функции:\n', solve(fd > 0))
print('\nИнтервалы убывания функции:\n', solve(fd < 0))

# 4. Построить график
p = plot(fx, (x, -2, 1.5))
print()
p = plot(fx, (x, -100, 100))

# 5. Вычислить вершину
apexs = solve(fd)
for i, apex in enumerate(apexs):
  print(f'Вершина {i+1}: {apex}')

# 6. Определить промежутки, на котором f > 0
# 7. Определить промежутки, на котором f < 0
print('Диапазон положительных значений функции:', solve(fx > 0))
print('Диапазон отрицательных значений функции:', solve(fx < 0))