first_names_list = ['Андрей', 'Борис', 'Александр', 'Григорий', 'Евгений', 'Алексей', 'Иван', 'Даниил', 'Петр', 'Анатолий',
                    'Остап', 'Георгий', 'Юрий', 'Олег', 'Армен', 'Захар', 'Илья', 'Игорь', 'Антон', 'Яков', 'Савелий',
                    'Максим', 'Артем', 'Сергей', 'Василий', 'Валентин', 'Эльдар', 'Степан', 'Никита', 'Егор', 'Владимир',
                    'Руслан', 'Семен', 'Вадим', 'Вячеслав', 'Станислав', 'Виталй', 'Лев', 'Богдан', 'Матвей', 'Федор',
                    'Роман', 'Денис', 'Павел', 'Кирилл', 'Михаил', 'Виктор', 'Константин', 'Дмитрий', 'Эдуард']

last_names_list = ['Михайлов', 'Петров', 'Третьяк', 'Яковлев', 'Малкин', 'Рагулин', 'Воробьев', 'Захаров', 'Панфилов',
                   'Потапов', 'Мелихов', 'Шарапов', 'Жеглов', 'Фокс', 'Балаганов', 'Облонский', 'Толстой', 'Бендер',
                   'Обломов', 'Корнилов', 'Романов', 'Врангель', 'Михельсон', 'Кудасов', 'Каменский', 'Могильный',
                   'Куролесов', 'Куприянов', 'Емельяненко', 'Хоботов', 'Меньшиков', 'Миронов', 'Леонов', 'Беглов',
                   'Гагарин', 'Васильев', 'Воробьянонов', 'Суриков', 'Репин', 'Быков', 'Корнеев',
                   'Зимин', 'Ларионов', 'Фетисов', 'Федоров', 'Овечкин', 'Дацук', 'Бурэ', 'Харламов', 'Мальцев']

disciplins = ['математика', 'физика', 'история', 'география', 'физкультура']

lessons = []